package cn.iocoder.common.framework.constant;

/**
 * 模块错误码区间
 *
 *  解决：解决各模块错误码定义，避免重复，在此只声明不做实际使用
 *
 *
 *  错误码定义说明：
 *
 *      [0-000-000-000] 1 开头，给业务系统，2 开头，给框架使用
 *
 *      如：用户系统，使用 1-001-000-000 段
 *
 * @author Sin
 * @time 2019-03-23 11:28
 */
public class ModuleErrorCodeInterval {

    // order 错误码区间 [1-000-001-000 ~ 1-000-002-000]

    // user 错误码区间 [1-001-000-000 ~ 1-002-000-000)

    // admin 错误码区间 [1-002-000-000 ~ 1-003-000-000)

    // product 错误码区间 [1-003-000-000 ~ 1-004-000-000)

    // pay 错误码区间 [1-004-000-000 ~ 1-005-000-000)



    // promotion 错误码区间 [1-006-000-000 ~ 1-007-000-000)


}